<<<<<<< HEAD


from app import app

if __name__ == '__main__':
    # host='0.0.0.0' يجعل الخادم يستمع على كل واجهات الشبكة (وليس فقط
    # 127.0.0.1)، لهذا يمكن الوصول إليه من هاتف على نفس شبكة Wi-Fi عبر
    # عنوان IP المحلي للحاسوب (مثل http://192.168.1.3:5000).

    app.run(debug=True, port=5000, host='0.0.0.0')
=======


from app import app

if __name__ == '__main__':
    # host='0.0.0.0' يجعل الخادم يستمع على كل واجهات الشبكة (وليس فقط
    # 127.0.0.1)، لهذا يمكن الوصول إليه من هاتف على نفس شبكة Wi-Fi عبر
    # عنوان IP المحلي للحاسوب (مثل http://192.168.1.3:5000).

    app.run(debug=True, port=5000, host='0.0.0.0')
>>>>>>> b98b9d955f458a6a5215a6f2be64d7edf9e90cc7
